Catalogs/ИндивидуальныйПланРазвития.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИндивидуальныйПланРазвития</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекомендацииРазвития</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КадровыйРезерв</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Мероприятия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УдалитьВидМероприятия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыМероприятияОбученияРазвития</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Мероприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МероприятияОбученияРазвития</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатВыполнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДействияСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДействиеСотрудника</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДействияСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазвиваемыеХарактеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ХарактеристикиПерсонала</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяОбучение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ХарактеристикиСотрудника</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ХарактеристикиПерсонала</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БаллХарактеристики</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьРазвивающиеДействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРазвивающихДействий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УдалитьВидыРазвивающихДействий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазвивающееДействие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатВыполнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИндивидуальныйПланРазвития/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Владелец)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоПодразделению(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Ученический договор
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Справочник.ИндивидуальныйПланРазвития";
	КомандаПечати.Идентификатор = "ИндивидуальныйПланРазвития";
	КомандаПечати.Представление = НСтр("ru = 'Индивидуальный план развития'");
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИндивидуальныйПланРазвития");
	Если НужноПечататьМакет Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ИндивидуальныйПланРазвития",
			НСтр("ru = 'Индивидуальный план развития'"),
			ПечатьИПР(МассивОбъектов, ОбъектыПечати),
			,
			"Справочник.ИндивидуальныйПланРазвития.ПФ_MXL_ИндивидуальныйПланРазвития");
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьИПР(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ИПР";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.ИндивидуальныйПланРазвития.ПФ_MXL_ИндивидуальныйПланРазвития");
	
	Области = Новый Структура();
	Области.Вставить("Шапка", Макет.ПолучитьОбласть("Шапка"));
	Области.Вставить("Строка", Макет.ПолучитьОбласть("СтрокаМероприятия"));
	
	ПоляПоискаРезультатов = "ФизическоеЛицо, Мероприятие, ДатаНачалаПлан, ДатаОкончанияПлан";
	ОтборРезультатов = Новый Структура(ПоляПоискаРезультатов);
	
	ДанныеДляПечати = ДанныеДляПечати(МассивОбъектов);
	Если ДанныеДляПечати.РезультатыОбучения <> Неопределено Тогда
		ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ДанныеДляПечати.РезультатыОбучения, ПоляПоискаРезультатов);
	КонецЕсли;
	
	Обход = Обработки.ОбходКоллекции.НовыйОбход(ДанныеДляПечати.ИндивидуальныеПланыРазвития);
	Пока Обход.СледующийПоЗначениюПоля("ИПР") Цикл
		ЗаполнитьЗначенияСвойств(Области.Шапка.Параметры, Обход.ТекущиеДанные());
		Области.Шапка.Параметры.ДатаНачалаИПР = Формат(Обход.ТекущиеДанные().ДатаНачалаИПР, "ДЛФ=D");
		Области.Шапка.Параметры.ДатаОкончанияИПР = Формат(Обход.ТекущиеДанные().ДатаОкончанияИПР, "ДЛФ=D");
		ТабличныйДокумент.Вывести(Области.Шапка);
		Пока Обход.СледующийПоЗначениямПолей("НомерСтроки") Цикл
			ЗаполнитьЗначенияСвойств(Области.Строка.Параметры, Обход.ТекущиеДанные());
			Области.Строка.Параметры.ДатаНачала = Формат(Обход.ТекущиеДанные().ДатаНачала, "ДЛФ=D");
			Области.Строка.Параметры.ДатаОкончания = Формат(Обход.ТекущиеДанные().ДатаОкончания, "ДЛФ=D");
			Области.Строка.Параметры.ФамилияИООтветственного = ФизическиеЛицаЗарплатаКадрыКлиентСервер.ФамилияИнициалы(
				Обход.ТекущиеДанные().ФИООтветственного);
			ПредставлениеРезультатов = "";
			Если ДанныеДляПечати.РезультатыОбучения <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ОтборРезультатов, Обход.ТекущиеДанные());
				ОтборРезультатов.ДатаНачалаПлан = Обход.ТекущиеДанные().ДатаНачала;
				ОтборРезультатов.ДатаОкончанияПлан = Обход.ТекущиеДанные().ДатаОкончания;
				РезультатыОбучения = ДанныеДляПечати.РезультатыОбучения.НайтиСтроки(ОтборРезультатов);
				ДополнитьПредставление(ПредставлениеРезультатов, 
					ОбучениеРазвитиеКлиентСервер.ПредставлениеРезультатовОбучения(РезультатыОбучения));
			КонецЕсли;
			ДополнитьПредставление(ПредставлениеРезультатов, Обход.ТекущиеДанные().РезультатВыполнения, Символы.ПС);
			Области.Строка.Параметры.Результаты = ПредставлениеРезультатов;
			ТабличныйДокумент.Вывести(Области.Строка);
		КонецЦикла;
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ДанныеДляПечати(МассивИПР)
	
	Данные = Новый Структура();
	Данные.Вставить("ИндивидуальныеПланыРазвития");
	Данные.Вставить("РезультатыОбучения");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивИПР);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИндивидуальныйПланРазвития.Ссылка КАК ИПР,
		|	ИндивидуальныйПланРазвития.Владелец КАК ФизическоеЛицо,
		|	ИндивидуальныйПланРазвития.Владелец.ФИО КАК ФИОСотрудника,
		|	ИндивидуальныйПланРазвития.Ответственный.ФизическоеЛицо КАК СотрудникКадровойСлужбы,
		|	ИндивидуальныйПланРазвития.Ответственный.ФизическоеЛицо.ФИО КАК ФИОСотрудникаКадровойСлужбы,
		|	ИндивидуальныйПланРазвития.ДатаНачала КАК ДатаНачалаИПР,
		|	ИндивидуальныйПланРазвития.ДатаОкончания КАК ДатаОкончанияИПР,
		|	ИндивидуальныйПланРазвития.Подразделение КАК Подразделение,
		|	ИндивидуальныйПланРазвития.РекомендацииРазвития КАК РекомендацииРазвития,
		|	ПрограммаОбучения.Мероприятие КАК Мероприятие,
		|	ПрограммаОбучения.ДатаНачала КАК ДатаНачала,
		|	ПрограммаОбучения.ДатаОкончания КАК ДатаОкончания,
		|	ПрограммаОбучения.РезультатВыполнения КАК РезультатВыполнения,
		|	ПрограммаОбучения.Ответственный КАК Ответственный,
		|	ЕСТЬNULL(ПрограммаОбучения.Ответственный.ФИО, """") КАК ФИООтветственного,
		|	ПрограммаОбучения.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Справочник.ИндивидуальныйПланРазвития КАК ИндивидуальныйПланРазвития
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИндивидуальныйПланРазвития.Мероприятия КАК ПрограммаОбучения
		|		ПО (ПрограммаОбучения.Ссылка = ИндивидуальныйПланРазвития.Ссылка)
		|ГДЕ
		|	ИндивидуальныйПланРазвития.Ссылка В (&МассивОбъектов)
		|УПОРЯДОЧИТЬ ПО
		|	ИПР,
		|	НомерСтроки";
	Данные.ИндивидуальныеПланыРазвития = Запрос.Выполнить().Выгрузить();
	
	Если ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ОбучениеСотрудников) Тогда
		Данные.РезультатыОбучения = ОбучениеРазвитие.РезультатыОбучения(
			Данные.ИндивидуальныеПланыРазвития.Скопировать(, 
				СтрСоединить(ОбщегоНазначения.ВыгрузитьКолонку(ОбучениеРазвитие.НовыйПланМероприятий().Колонки, "Имя"), ",")));
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Процедура ДополнитьПредставление(Представление, Дополнение, Разделитель = ", ") Экспорт
	ОбучениеРазвитиеКлиентСервер.ДополнитьПредставление(Представление, Дополнение, Разделитель);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
